#include <math.h>
#include <cstdlib>
#include <iostream>
#include <sstream>
#include <iomanip>
using namespace std;

// Визначення "чарівних" констант
#define P32 0xB7E15163
#define Q32 0x9E3779B9

// Забороняється змінювати сигнатуру функції Task1!  

// Функція циклічного зсуву вліво
// x - число, яке підлягає зсуву
// n - кількість розрядів, на яку відбувається зсув
unsigned int ROL(unsigned int x, unsigned int n) {	    
    // Розмістіть тут Ваш код
}

// Функція циклічного зсуву вправо
// x - число, яке підлягає зсуву
// n - кількість розрядів, на яку відбувається зсув
unsigned int ROR(unsigned int x, unsigned int n) {	
   // Розмістіть тут Ваш код
}

// Функція генерування розпорядку ключів
// K - ключ користувача
// S - масив раундових ключів (функція здійснює його заповнення)
void RC5_Key_Shedule(unsigned int* K, unsigned int* S) {	
    // Розмістіть тут Ваш код
}

// Функція шифрування RC5
// M - масив чисел повідомлення
// C - масив чисел шифру (функція здійснює його заповнення)
// S - масив раундових ключів (попередньо заповнений функцією RC5_Key_Shedule)
void RC5_Encrypt(unsigned int* M, unsigned int* C, unsigned int* S) {	
    // Розмістіть тут Ваш код
}

// Функція дешифрування RC5
// Функція шифрування RC5
// C - масив чисел шифру
// M - масив чисел повідомлення (функція здійснює його заповнення)
// S - масив раундових ключів (попередньо заповнений функцією RC5_Key_Shedule)
void RC5_Decrypt(unsigned int* C, unsigned int* M, unsigned int* S) {
    // Розмістіть тут Ваш код
}


// Завдання 1
// 
// Функція приймає у якості аргументів:
// source - масив джерела інформації (масив шістнадцяткових чисел), 
// sourceSize - кількість елементів масиву джерела інформації, 
// key - масив ключа (масив шістнадцяткових чисел), 
// encryptionMode - передається true у випадку, коли необхідно здійснити 
//                  шифрування елементів масиву джерела інформації за 
//                  алгоритмом RC5 і false - коли необхідно здійснити 
//                  дешифрування.
// 
// Функція повинна повертати рядок, який містить вивід результату застосування 
// процедури шифрування (дешифрування) за алгоритмом RC5 до масиву джерела 
// інформації (послідовність розділених пробілами шістнадцяткових чисел без 
// префіксу "0x" із великими шістнадцятковими літерами). 
// Наприклад (масиви M2 та K2 були визначені попередньо):
// Task1("M2,  4, K2, true") - "90423F35 F41D46C7 3A06D9F2 81823FEE" (без лапок)
string Task1 (unsigned int* source, unsigned int sourceSize, unsigned int* key, bool encryptionMode) {
    // Об'єктом stringstream можна користуватись як і об'єктом iostream
    // Наприклад, коректним є запис
    // functionOutput << arr[i] << " ";
    stringstream functionOutput;
    
    // Розмістіть тут Ваш код

    // Вивід результатів
    functionOutput << uppercase << hex << setfill('0') << setw(8) << /* Розмістіть тут Ваш код */;

    // Розмістіть тут Ваш код

    // Конвертування об'єкту stringstream у рядок для відповідності сигнатурі функції
    return functionOutput.str();
}
